; domain
(define (domain grid_world ) 
(:requirements :strips :typing) 
(:types car
agent - car
gridcell
) 
(:predicates (at ?pt1 - gridcell ?car - car) 
(up_next ?pt1 - gridcell ?pt2 - gridcell) 
(down_next ?pt1 - gridcell ?pt2 - gridcell) 
(forward_next ?pt1 - gridcell ?pt2 - gridcell) 
(blocked ?pt1 - gridcell) 
) 
(:action UP
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agt - agent) 
:precondition (and (at ?pt1 ?agt) (not (blocked ?pt2)) (up_next ?pt1 ?pt2))
:effect (and (not (at ?pt1 ?agt)) (at ?pt2 ?agt))
) 
(:action DOWN
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agt - agent) 
:precondition (and (at ?pt1 ?agt) (not (blocked ?pt2)) (down_next ?pt1 ?pt2))
:effect (and (not (at ?pt1 ?agt)) (at ?pt2 ?agt))
) 
(:action FORWARD
:parameters ( ?pt1 - gridcell ?pt2 - gridcell ?agt - agent) 
:precondition (and (at ?pt1 ?agt) (not (blocked ?pt2)) (forward_next ?pt1 ?pt2))
:effect (and (not (at ?pt1 ?agt)) (at ?pt2 ?agt))
) 
)

; problem
(define (problem parking) 
 (:domain grid_world) 
(:objects agent1  - agent
 pt0pt0 pt0pt1 pt0pt2 pt1pt0 pt1pt1 pt1pt2 pt2pt0 pt2pt1 pt2pt2 pt3pt0 pt3pt1 pt3pt2 pt4pt0 pt4pt1 pt4pt2  - gridcell
 ) 
(:init (at pt4pt2 agent1) 
(at pt1pt0 car0) (at pt1pt2 car4) (at pt3pt0 car1) (at pt0pt2 car5) (at pt4pt1 car2) (at pt0pt1 car3) 
(blocked pt1pt0) (blocked pt1pt2) (blocked pt3pt0) (blocked pt0pt2) (blocked pt4pt1) (blocked pt0pt1) 
(forward_next pt1pt0 pt0pt0) (forward_next pt1pt1 pt0pt1) (forward_next pt1pt2 pt0pt2) (forward_next pt2pt0 pt1pt0) (forward_next pt2pt1 pt1pt1) (forward_next pt2pt2 pt1pt2) (forward_next pt3pt0 pt2pt0) (forward_next pt3pt1 pt2pt1) (forward_next pt3pt2 pt2pt2) (forward_next pt4pt0 pt3pt0) (forward_next pt4pt1 pt3pt1) (forward_next pt4pt2 pt3pt2) 
(up_next pt1pt1 pt0pt0) (up_next pt1pt2 pt0pt1) (up_next pt2pt1 pt1pt0) (up_next pt2pt2 pt1pt1) (up_next pt3pt1 pt2pt0) (up_next pt3pt2 pt2pt1) (up_next pt4pt1 pt3pt0) (up_next pt4pt2 pt3pt1) 
(down_next pt1pt0 pt0pt1) (down_next pt1pt1 pt0pt2) (down_next pt2pt0 pt1pt1) (down_next pt2pt1 pt1pt2) (down_next pt3pt0 pt2pt1) (down_next pt3pt1 pt2pt2) (down_next pt4pt0 pt3pt1) (down_next pt4pt1 pt3pt2) 
(forward_next pt0pt0 pt4pt0) (forward_next pt0pt1 pt4pt1) (forward_next pt0pt2 pt4pt2) 
(up_next pt0pt1 pt4pt0) (up_next pt0pt2 pt4pt1) 
(down_next pt0pt0 pt4pt1) (down_next pt0pt1 pt4pt2)) 
(:goal (at pt0pt0 agent1)) 
)

; plan
1. (forward pt4pt2 pt3pt2 agent1)
   deleted: (at pt4pt2 agent1)
   added: (at pt3pt2 agent1)
   goals met: 0 of 1
2. (up pt3pt2 pt2pt1 agent1)
   deleted: (at pt3pt2 agent1)
   added: (at pt2pt1 agent1)
   goals met: 0 of 1
3. (forward pt2pt1 pt1pt1 agent1)
   deleted: (at pt2pt1 agent1)
   added: (at pt1pt1 agent1)
   goals met: 0 of 1
4. (up pt1pt1 pt0pt0 agent1)
   deleted: (at pt1pt1 agent1)
   added: (at pt0pt0 agent1)
   goals met: 1 of 1
